note/drawio/converted/dot/260414-mealy-moore.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_L5CW1b4Si_8L8Gd6nkXg_1" [label="A"];
  "n_L5CW1b4Si_8L8Gd6nkXg_13" [label="input==0output=0"];
  "n_L5CW1b4Si_8L8Gd6nkXg_2" [label="node_nkXg-2"];
  "n_L5CW1b4Si_8L8Gd6nkXg_3" [label="B"];
  "n_L5CW1b4Si_8L8Gd6nkXg_4" [label="C"];
  "n_L5CW1b4Si_8L8Gd6nkXg_5" [label="D"];
  "n_WX8bb4Ay61HHlQuAzu0b_1" [label="input==1output=0"];
  "n_WX8bb4Ay61HHlQuAzu0b_2" [label="input==1output=0"];
  "n_WX8bb4Ay61HHlQuAzu0b_3" [label="input==0output=0"];
  "n_WX8bb4Ay61HHlQuAzu0b_4" [label="input==1output=0"];
  "n_WX8bb4Ay61HHlQuAzu0b_6" [label="input==0output=1"];
  "n_WX8bb4Ay61HHlQuAzu0b_7" [label="input==1output=0"];
  "n_WX8bb4Ay61HHlQuAzu0b_8" [label="input==0output=0"];
  "n_ca6LpFP6NE2KJj1RpuLm_10" [label="0"];
  "n_ca6LpFP6NE2KJj1RpuLm_14" [label="1"];
  "n_ca6LpFP6NE2KJj1RpuLm_15" [label="0"];
  "n_ca6LpFP6NE2KJj1RpuLm_2" [label="1"];
  "n_ca6LpFP6NE2KJj1RpuLm_4" [label="0"];
  "n_ca6LpFP6NE2KJj1RpuLm_6" [label="1"];
  "n_ca6LpFP6NE2KJj1RpuLm_8" [label="0"];
  "n_dymsDe6c_Ul1_7q9bfgP_11" [label="B0"];
  "n_dymsDe6c_Ul1_7q9bfgP_15" [label="C0"];
  "n_dymsDe6c_Ul1_7q9bfgP_17" [label="D0"];
  "n_dymsDe6c_Ul1_7q9bfgP_20" [label="1"];
  "n_dymsDe6c_Ul1_7q9bfgP_23" [label="E1"];
  "n_dymsDe6c_Ul1_7q9bfgP_25" [label="1"];
  "n_dymsDe6c_Ul1_7q9bfgP_4" [label="0"];
  "n_dymsDe6c_Ul1_7q9bfgP_7" [label="A0"];
  "n_dymsDe6c_Ul1_7q9bfgP_9" [label="node_bfgP-9"];
  "n_L5CW1b4Si_8L8Gd6nkXg_4" -> "n_L5CW1b4Si_8L8Gd6nkXg_1";
  "n_L5CW1b4Si_8L8Gd6nkXg_5" -> "n_L5CW1b4Si_8L8Gd6nkXg_3";
  "n_L5CW1b4Si_8L8Gd6nkXg_4" -> "n_L5CW1b4Si_8L8Gd6nkXg_5";
  "n_L5CW1b4Si_8L8Gd6nkXg_3" -> "n_L5CW1b4Si_8L8Gd6nkXg_4";
  "n_L5CW1b4Si_8L8Gd6nkXg_5" -> "n_L5CW1b4Si_8L8Gd6nkXg_1";
  "n_L5CW1b4Si_8L8Gd6nkXg_1" -> "n_L5CW1b4Si_8L8Gd6nkXg_3";
  "n_L5CW1b4Si_8L8Gd6nkXg_1" -> "n_L5CW1b4Si_8L8Gd6nkXg_1";
  "n_L5CW1b4Si_8L8Gd6nkXg_2" -> "n_L5CW1b4Si_8L8Gd6nkXg_1";
  "n_dymsDe6c_Ul1_7q9bfgP_23" -> "n_dymsDe6c_Ul1_7q9bfgP_7";
  "n_dymsDe6c_Ul1_7q9bfgP_7" -> "n_dymsDe6c_Ul1_7q9bfgP_7";
  "n_dymsDe6c_Ul1_7q9bfgP_7" -> "n_dymsDe6c_Ul1_7q9bfgP_11";
  "n_dymsDe6c_Ul1_7q9bfgP_9" -> "n_dymsDe6c_Ul1_7q9bfgP_7";
  "n_dymsDe6c_Ul1_7q9bfgP_11" -> "n_dymsDe6c_Ul1_7q9bfgP_15";
  "n_dymsDe6c_Ul1_7q9bfgP_15" -> "n_dymsDe6c_Ul1_7q9bfgP_17";
  "n_dymsDe6c_Ul1_7q9bfgP_15" -> "n_dymsDe6c_Ul1_7q9bfgP_7";
  "n_dymsDe6c_Ul1_7q9bfgP_17" -> "n_dymsDe6c_Ul1_7q9bfgP_11";
  "n_dymsDe6c_Ul1_7q9bfgP_17" -> "n_dymsDe6c_Ul1_7q9bfgP_23";
  "n_dymsDe6c_Ul1_7q9bfgP_23" -> "n_dymsDe6c_Ul1_7q9bfgP_11";
}
