note/drawio/converted/mermaid/260414-mealy-moore.mmd
flowchart LR
  n_L5CW1b4Si_8L8Gd6nkXg_1["A"]
  n_L5CW1b4Si_8L8Gd6nkXg_13["input==0output=0"]
  n_L5CW1b4Si_8L8Gd6nkXg_2["node_nkXg-2"]
  n_L5CW1b4Si_8L8Gd6nkXg_3["B"]
  n_L5CW1b4Si_8L8Gd6nkXg_4["C"]
  n_L5CW1b4Si_8L8Gd6nkXg_5["D"]
  n_WX8bb4Ay61HHlQuAzu0b_1["input==1output=0"]
  n_WX8bb4Ay61HHlQuAzu0b_2["input==1output=0"]
  n_WX8bb4Ay61HHlQuAzu0b_3["input==0output=0"]
  n_WX8bb4Ay61HHlQuAzu0b_4["input==1output=0"]
  n_WX8bb4Ay61HHlQuAzu0b_6["input==0output=1"]
  n_WX8bb4Ay61HHlQuAzu0b_7["input==1output=0"]
  n_WX8bb4Ay61HHlQuAzu0b_8["input==0output=0"]
  n_ca6LpFP6NE2KJj1RpuLm_10["0"]
  n_ca6LpFP6NE2KJj1RpuLm_14["1"]
  n_ca6LpFP6NE2KJj1RpuLm_15["0"]
  n_ca6LpFP6NE2KJj1RpuLm_2["1"]
  n_ca6LpFP6NE2KJj1RpuLm_4["0"]
  n_ca6LpFP6NE2KJj1RpuLm_6["1"]
  n_ca6LpFP6NE2KJj1RpuLm_8["0"]
  n_dymsDe6c_Ul1_7q9bfgP_11["B0"]
  n_dymsDe6c_Ul1_7q9bfgP_15["C0"]
  n_dymsDe6c_Ul1_7q9bfgP_17["D0"]
  n_dymsDe6c_Ul1_7q9bfgP_20["1"]
  n_dymsDe6c_Ul1_7q9bfgP_23["E1"]
  n_dymsDe6c_Ul1_7q9bfgP_25["1"]
  n_dymsDe6c_Ul1_7q9bfgP_4["0"]
  n_dymsDe6c_Ul1_7q9bfgP_7["A0"]
  n_dymsDe6c_Ul1_7q9bfgP_9["node_bfgP-9"]
  n_L5CW1b4Si_8L8Gd6nkXg_4 --> n_L5CW1b4Si_8L8Gd6nkXg_1
  n_L5CW1b4Si_8L8Gd6nkXg_5 --> n_L5CW1b4Si_8L8Gd6nkXg_3
  n_L5CW1b4Si_8L8Gd6nkXg_4 --> n_L5CW1b4Si_8L8Gd6nkXg_5
  n_L5CW1b4Si_8L8Gd6nkXg_3 --> n_L5CW1b4Si_8L8Gd6nkXg_4
  n_L5CW1b4Si_8L8Gd6nkXg_5 --> n_L5CW1b4Si_8L8Gd6nkXg_1
  n_L5CW1b4Si_8L8Gd6nkXg_1 --> n_L5CW1b4Si_8L8Gd6nkXg_3
  n_L5CW1b4Si_8L8Gd6nkXg_1 --> n_L5CW1b4Si_8L8Gd6nkXg_1
  n_L5CW1b4Si_8L8Gd6nkXg_2 --> n_L5CW1b4Si_8L8Gd6nkXg_1
  n_dymsDe6c_Ul1_7q9bfgP_23 --> n_dymsDe6c_Ul1_7q9bfgP_7
  n_dymsDe6c_Ul1_7q9bfgP_7 --> n_dymsDe6c_Ul1_7q9bfgP_7
  n_dymsDe6c_Ul1_7q9bfgP_7 --> n_dymsDe6c_Ul1_7q9bfgP_11
  n_dymsDe6c_Ul1_7q9bfgP_9 --> n_dymsDe6c_Ul1_7q9bfgP_7
  n_dymsDe6c_Ul1_7q9bfgP_11 --> n_dymsDe6c_Ul1_7q9bfgP_15
  n_dymsDe6c_Ul1_7q9bfgP_15 --> n_dymsDe6c_Ul1_7q9bfgP_17
  n_dymsDe6c_Ul1_7q9bfgP_15 --> n_dymsDe6c_Ul1_7q9bfgP_7
  n_dymsDe6c_Ul1_7q9bfgP_17 --> n_dymsDe6c_Ul1_7q9bfgP_11
  n_dymsDe6c_Ul1_7q9bfgP_17 --> n_dymsDe6c_Ul1_7q9bfgP_23
  n_dymsDe6c_Ul1_7q9bfgP_23 --> n_dymsDe6c_Ul1_7q9bfgP_11
